benchmark/report/rps/full/20260804_184656/raw/029_download_1kb_c1_r1.txt
Running 20s test @ http://127.0.0.1:32784/api/files/by-hash/0a5783446d17f244303ce6cd4b9f7f704b155cca266707e1d6f67561844b7f49/download
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.12ms    1.99ms  27.50ms   67.24%
    Req/Sec   139.80     32.40   250.00     84.00%
  Latency Distribution
     50%    7.34ms
     75%    8.51ms
     90%    9.42ms
     99%   11.32ms
  2794 requests in 20.07s, 4.34MB read
Requests/sec:    139.21
Transfer/sec:    221.18KB
HPS_WRK_REQUESTS 2794
HPS_WRK_STATUS_ERRORS 0
HPS_SOCKET_CONNECT 0
HPS_SOCKET_READ 0
HPS_SOCKET_WRITE 0
HPS_SOCKET_TIMEOUT 0
HPS_STATUS_TOTAL 2794
HPS_STATUS_2XX 2794
HPS_STATUS_NON_2XX 0
HPS_STATUS_UNEXPECTED 0
HPS_STATUS_CODES 200=2794